In [1]:
import numpy as np
import pandas as pd

In [2]:
dframe = pd.DataFrame({'k1': list('XXYYZ'),
                      'k2': ['alpha', 'beta', 'alpha', 'beta', 'alpha'],
                      'dataset1': np.random.randn(5),
                      'dataset2': np.random.randn(5)})
dframe

  k1     k2  dataset1  dataset2
0  X  alpha -0.347842  0.923373
1  X   beta -0.417281  0.623571
2  Y  alpha -0.571923  0.756111
3  Y   beta -1.655214 -1.521393
4  Z  alpha  1.572906 -0.413183

In [8]:
group1 = dframe['dataset1'].groupby(dframe['k1'])
group1

In [9]:
group1.mean()

k1
X   -0.382562
Y   -1.113569
Z    1.572906
Name: dataset1, dtype: float64

In [12]:
cities = np.array(['NY', 'LA', 'LA', 'NY', 'NY'])

month = np.array(['JAN', 'FEB', 'JAN', 'FEB', 'JAN'])

In [13]:
dframe['dataset1'].groupby([cities, month]).mean()

LA  FEB   -0.417281
    JAN   -0.571923
NY  FEB   -1.655214
    JAN    0.612532
Name: dataset1, dtype: float64

In [14]:
dframe

  k1     k2  dataset1  dataset2
0  X  alpha -0.347842  0.923373
1  X   beta -0.417281  0.623571
2  Y  alpha -0.571923  0.756111
3  Y   beta -1.655214 -1.521393
4  Z  alpha  1.572906 -0.413183

In [15]:
dframe.groupby(['k1', 'k2']).mean()

          dataset1  dataset2
k1 k2
X  alpha -0.347842  0.923373
   beta  -0.417281  0.623571
Y  alpha -0.571923  0.756111
   beta  -1.655214 -1.521393
Z  alpha  1.572906 -0.413183

In [16]:
dframe.groupby(['k1']).size()

k1
X    2
Y    2
Z    1
dtype: int64

In [25]:
for name,group in dframe.groupby('k1'):
    print("This is the", name, "group")
    print (group)
    print("\n")

This is the X group
  k1     k2  dataset1  dataset2
0  X  alpha -0.347842  0.923373
1  X   beta -0.417281  0.623571


This is the Y group
  k1     k2  dataset1  dataset2
2  Y  alpha -0.571923  0.756111
3  Y   beta -1.655214 -1.521393


This is the Z group
  k1     k2  dataset1  dataset2
4  Z  alpha  1.572906 -0.413183

In [29]:
for (k1, k2), group in dframe.groupby(['k1', 'k2']):
    print ("Key1 = %s Key2 = %s" %(k1, k2))
    print (group)
    print ('\n')

Key1 = X Key2 = alpha
  k1     k2  dataset1  dataset2
0  X  alpha -0.347842  0.923373


Key1 = X Key2 = beta
  k1    k2  dataset1  dataset2
1  X  beta -0.417281  0.623571


Key1 = Y Key2 = alpha
  k1     k2  dataset1  dataset2
2  Y  alpha -0.571923  0.756111


Key1 = Y Key2 = beta
  k1    k2  dataset1  dataset2
3  Y  beta -1.655214 -1.521393


Key1 = Z Key2 = alpha
  k1     k2  dataset1  dataset2
4  Z  alpha  1.572906 -0.413183

In [55]:
group_dict = dict(list(dframe.groupby(['k1'])))

In [58]:
group_dict['X']

  k1     k2  dataset1  dataset2
0  X  alpha -0.347842  0.923373
1  X   beta -0.417281  0.623571

In [62]:
group_dict_axis = dict(list(dframe.groupby(dframe.dtypes, axis = 1)))
group_dict_axis

# seperate the dataframe with datatype

{dtype('float64'):    dataset1  dataset2
 0 -0.347842  0.923373
 1 -0.417281  0.623571
 2 -0.571923  0.756111
 3 -1.655214 -1.521393
 4  1.572906 -0.413183, dtype('O'):   k1     k2
 0  X  alpha
 1  X   beta
 2  Y  alpha
 3  Y   beta
 4  Z  alpha}

In [64]:
dataset2_group = dframe.groupby(['k1', 'k2'])[['dataset2']]
dataset2_group.mean()

          dataset2
k1 k2
X  alpha  0.923373
   beta   0.623571
Y  alpha  0.756111
   beta  -1.521393
Z  alpha -0.413183